INSERT INTO clients(full_name, telephone, email)
VALUES ('Царёв Иван Иванович', '+7 (916) 489-56-78',	'ivan1970@rambler.ru'), 
      ('Дьякова Ольга Александровна',	'+7 (916) 419-52-28',	'HostileMine@gmail.com'),
      ('Бондарева Мария Артёмовна',	'+7 (924) 481-44-48',	'marina28071981@gmail.com'),
      ('Карасев Пётр Романович',	'+7 (979) 604-27-81',	'petr08081982@mail.ru'),
      ('Селиванова Мария Тихоновна',	'+7 (986) 141-29-60',	'marina24021969@ya.ru'),
      ('Иванова Виктория Мироновна',	'+7 (931) 257-59-25',	'SoaringDuke@gmail.com'),
      ('Дорофеев Павел Владимирович',	'+7 (918) 417-66-73',	'pavel26@gmail.com'),
      ('Шаповалов Василий Кириллович',	'+7 (912) 624-12-58',	'vasiliy12@outlook.com'),
      ('Смирнова Мария Ивановна',	'+7 (941) 443-17-81',	'marina04031991@rambler.ru'),
      ('Суворов Александр Евгеньевич',	'+7 (937) 612-87-19',	'kankenghu@list.ru');

INSERT INTO establishments(address_establishment, postcode, telephone)
VALUES ('г. Москва, ул. Авиаконструктора Яковлева, д.3', '108811',	'+7 (917) 399-94-34'),
      ('г. Москва, бульвар Адмирала Ушакова, д.41',	'107150',	'+7 (911) 952-94-54'),
      ('г. Москва, ул. Энтузиастов 1-я, д.6',	'105082',	'+7 (994) 917-78-29'),
      ('г. Москва, ул. Стромынка, д.20',	'107996',	'+7 (931) 965-97-49');

INSERT INTO employees(full_name, telephone, email, experience, salary, brief_info, age, post)
VALUES ('Бухарова Анфиса Климентьевна',	'+7 (931) 965-97-49',	'anfisa.buharova@rambler.ru',	120,	30000,	'Алкоголичка',	35,	'Уборщик'),
      ('Карнаухова Кира Фадеевна',	'+7 (920) 940-36-43',	'kira1983@hotmail.com',	12,	29000,	'Была судима',	40,	'Уборщик'),
      ('Таттар Григорий Афанасьевич',	'+7 (961) 862-83-98',	'grigoriy98@mail.ru',	39,	30000,	'Спортсмен',	20,	'Уборщик'),
      ('Никерхоев Юрий Ипполитович',	'+7 (918) 885-46-83',	'yuriy1988@gmail.com',	48,	61500,	'Надёжный сотрудник',	31,	'Менеджер'),
      ('Кулдошина Татьяна Марковна',	'+7 (975) 606-91-81',	'tatyana1970@hotmail.com',	0,	33000,	'Новичок',	24,	'Менеджер'),
      ('Балина Лариса Никитьевна',	'+7 (948) 799-16-36',	'larisa2451@mail.ru',	31,	120000,	'Относиться с уважением, решает любые проблемы',	37,	'Управляющий'),
      ('Ефимов Михаил Яковлевич',	'+7 (925) 187-23-82',	'mihail23051996@yandex.ru',	19,	101000,	'Расист',	32,	'Управляющий'),
      ('Рудакова Серафима Романовна',	'+7 (909) 657-23-13',	'serafima50@ya.ru',	9,	97300,	'Трудолюбивая, ответственная',	26,	'Управляющий'),
      ('Масленникова Катерина Феодосьевна',	'+7 (969) 434-47-71',	'katerina7773@ya.ru',	30,	120000,	'Стеснительная, быстро подстраивается под неожиданные ситуации',	35,	'Управляющий'),
      ('Хренов Евгений Тимофеевич', '+7 (921) 948-34-79',	'evgeniy51@outlook.com',	5,	123000,	'Окончил вуз',	24,	'Администратор'),
      ('Мальцева Милана Трофимовна', '+7 (963) 801-98-62',	'milana29@hotmail.com',	10,	110000,	'Новичок',	28,	'Аналитик'),
      ('Куусинен Петр Викторович', '+7 (973) 472-59-17',	'petr9722@yandex.ru',	86,	163200,	'Старший аналитик',	43,	'Аналитик'),
      ('Якимова Варвара Григорьевна', '+7 (956) 254-33-29',	'varvara37@ya.ru',	2,	30000,	'Новичок, закончила престижный колледж',	24,	'Парикмахер'),
      ('Рудавина Галина Панкратовна', '+7 (905) 514-58-90',	'galina1979@rambler.ru',	23,	42120,	'Вышла из дикрета',	27,	'Парикмахер'),
      ('Якухин Даниил Валентинович', '+7 (962) 724-96-61',	'daniil88@mail.ru',	79,	63700,	'Старший парикмахер, профессионал своего дела',	35,	'Парикмахер'),
      ('Семянин Василий Валерьевич', '+7 (929) 843-53-62',	'vasiliy4235@ya.ru',	50,	55840,	'Многодетный отец, разведён, надёжный сотрудник',	33,	'Парикмахер');

INSERT INTO services(name_service, cost, duration)
VALUES ('Стрижка волос наголо', 500, '13M'),
      ('Стрижка простая', 1000, '20M'),
      ('Стрижка модельная', 2000, '30M'),
      ('Стрижка бороды/усов',	700,	'12M'),
      ('Окрашивание',	1100,	'25M'),
      ('Стрижка детская', 800,	'15M'),
      ('Завивка волос',	1500,	'25M'),
      ('Подкрашивание',	600,	'20M'),
      ('Обесцвечивание', 1000,	'16M'),
      ('Укрепление волос', 1000,	'18M'),
      ('Укладка волос после окрашивания',	500,	'7M'),
      ('Укладка',	500,	'7M'),
      ('Мелирование волос',	2500,	'30M'),
      ('Выведение волос из темного цвета в блонд',	2000,	'25M'),
      ('Стрижка челки',	400,	'10M');

INSERT INTO employee_service(employee_id, service_id)
VALUES (15,	1), (15,	2), (15,	3), (15,	4), (15,	5), (15,	6), (15,	7), (15,	8), 
      (15,	9), (15,	10), (15,	11), (15,	12), (15,	13), (15,	14), (15,	15),
      (16,	1), (16,	2), (16,	3), (16,	4), (16,	5), (16,	6), (16,	7), (16,	8), 
      (16,	9), (16,	10), (16,	11), (16,	12), (16,	13), (16,	14), (16,	15),
      (14,	1), (14,	2), (14,	3), (14,	4), (14,	6), (14,	10), (14,	11), (14,	12), (14,	15), 
      (13,	1), (13,	2), (13,	4), (13,	6), (13,	7), (13,	8), (13,	10), (13,	12), (13,	15);

INSERT INTO schedule(date_work, start_work, end_work, presence, establishment_id, employee_id)
VALUES ('07-20-2023', '8:00:00', '17:00:00', true, 1, 1),
      ('07-20-2023', '14:00:00', '23:00:00', true, 1, 2), 
      ('07-20-2023', '8:00:00', '17:00:00', true, 2, 1), 
      ('07-20-2023', '14:00:00', '23:00:00', true, 2, 3),
      ('07-21-2023', '8:00:00', '17:00:00', true, 3, 2),
      ('07-21-2023', '14:00:00', '23:00:00', true, 3, 1),
      ('07-21-2023', '8:00:00', '17:00:00', true, 4, 2), 
      ('07-21-2023', '14:00:00', '23:00:00', true, 4, 3),
      ('07-20-2023', '9:00:00', '22:00:00', true, 1, 4), /* Менеджер 4 */
      ('07-20-2023', '9:00:00', '22:00:00', true, 1, 6), /* Управляющий 6 только в 1 */
      ('07-20-2023', '9:00:00', '22:00:00', true, 2, 7), /* Управляющий 7 только в 2 */
      ('07-21-2023', '9:00:00', '22:00:00', true, 3, 5), /* Менеджер 5 */
      ('07-21-2023', '9:00:00', '22:00:00', true, 3, 8), /* Управляющий 8 только в 3 */
      ('07-21-2023', '9:00:00', '22:00:00', true, 4, 9), /* Управляющий 9 только в 4 */
      ('07-20-2023', '12:00:00', '20:00:00', true, 1, 10), /* Администратор */
      ('07-21-2023', '12:00:00', '20:00:00', true, 3, 10), /* Администратор */
      ('07-21-2023', '8:00:00', '22:00:00', true, 2, 11), /* Аналитик */
      ('07-21-2023', '8:00:00', '22:00:00', true, 4, 12), /* Аналитик */
      ('07-20-2023', '9:00:00', '18:00:00', true, 1, 15), /* Парикмахер 15 */
      ('07-20-2023', '13:00:00', '22:00:00', true, 2, 16), /* Парикмахер 16 */
      ('07-20-2023', '9:00:00', '18:00:00', true, 1, 13), /* Парикмахер 13 */
      ('07-20-2023', '13:00:00', '22:00:00', true, 2, 14), /* Парикмахер 14 */
      ('07-21-2023', '9:00:00', '18:00:00', true, 3, 15), /* Парикмахер 15 */
      ('07-21-2023', '13:00:00', '22:00:00', true, 4, 16), /* Парикмахер 16 */
      ('07-21-2023', '9:00:00', '18:00:00', true, 3, 13), /* Парикмахер 13 */
      ('07-21-2023', '13:00:00', '22:00:00', true, 4, 14); /* Парикмахер 14 */